# =============================================================================
# Personal-only Homebrew packages
#
# Only installed when running: ./install.sh --profile personal
#
# Add packages here that are blocked on your work laptop or only
# needed on your personal machine.
# =============================================================================

# Examples:
# cask "istat-menus"
# cask "steam"
# cask "vlc"
# cask "transmission"
brew "antoniorodr/memo/memo"
brew "duti"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jaxxstorm/tap/tscli"
brew "jq"
brew "lazygit"
brew "nodenv"
brew "ollama"
brew "poppler"
brew "postgresql@18"
brew "powershell/tap/powershell"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "yazi"
brew "zoxide"
cask "1password-cli"
cask "airbuddy"
cask "android-file-transfer"
cask "anki"
cask "applite"
cask "audacity"
cask "balenaetcher"
cask "bartender"
cask "brave-browser"
cask "copilot-cli"
cask "darktable"
cask "dash"
cask "displaycal"
cask "docker-desktop"
cask "downie"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "github"
cask "hammerspoon"
cask "hyperkey"
cask "keyclu"
cask "mullvad-vpn"
cask "ngrok/ngrok/ngrok"
cask "nordvpn"
cask "obs"
cask "postman"
cask "raspberry-pi-imager"
cask "rectangle"
cask "signal"
cask "ssh-config-editor"
cask "textexpander"
cask "tower"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
tap "antoniorodr/memo"
tap "jaxxstorm/tap"
tap "ngrok/ngrok"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
